In [6]:
import numpy as np
import pandas as pd

##### 1. FROM AN ARRAY

In [3]:
# Create an array
first_data_example = np.array([[1, 2], [2, 4]])
first_data_example

array([[1, 2],
       [2, 4]])

In [4]:
# Common name for a DataFrame: df

first_dataframe = pd.DataFrame(first_data_example, index=["lol", "lel"], columns=["col1", "col2"])
first_dataframe

     col1  col2
lol     1     2
lel     2     4

##### FROM A LIST

In [5]:
# Create an array
example_list = [[1, 2], [2, 4]]
example_list

[[1, 2], [2, 4]]

In [7]:
second_df = pd.DataFrame(example_list)
second_df

   0  1
0  1  2
1  2  4

##### 2. FROM A DICTIONARY

In [ ]:
maldini_keys = ["age", "colour", "sex"]
maldini_values = ["56", "red and black", "yes"]

In [2]:
maldini_dict = {"keys":maldini_keys, "values": maldini_values}
maldini_dict

{'keys': ['age', 'colour', 'sex'], 'values': ['56', 'red and black', 'yes']}

In [5]:
df = pd.DataFrame({"keys":maldini_keys, "values": maldini_values})
df

     keys         values
0     age             56
1  colour  red and black
2     sex            yes

##### 3. FROM CSV

In [3]:
import os

os.getcwd()
csv_path = os.path.join(os.getcwd(), "..", "data", "StudentsPerformance.csv")

In [4]:
csv_path

'c:\\Users\\Giacomo Da Re\\git\\Python_DataScience\\script\\Numpy_Pandas_Introduction\\scripts\\..\\data\\StudentsPerformance.csv'

In [7]:
exams = pd.read_csv(csv_path)

In [8]:
exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [11]:
exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86